Revit 2024 API
ProgressChangedEventArgs.Caption Property
 The text from the progress bar caption that describes the operation in progress
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string Caption { get; }
Visual Basic
Public ReadOnly Property Caption As String
	Get
Visual C++
public:
property String^ Caption {
	String^ get ();
}
See Also
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace